package Homework1;

public class NumeralSystem {

    // 10110011 (двоичная)
    // 10110011 = 1*2^(7) + 0*2^(6) + 1*2^(5) +1*2^(4) + 0*2^(3) + 0*2^(2) + 1*2^(1) + 1*2^(0) = 128 + 0 + 32 + 16 + 0 + 0 + 2 + 1 = 179 (десятичная)

    // 10110011 (двоичная)
    // 10110011 в шестнадцатеричную
    // 2. 179/16=11 (остаток 3)
    // 1.  11/16=0  (остаток 11 = B)
    // 10110011 = 179 = B3

    // B3 (шестнадцатеричная)
    // B3 = 11*16^(1) + 3*16^(0) = 176 + 3 = 179 (десятичная)

    // B3
    // 8. 179/2 = 89 (остаток 1)
    // 7.  89/2 = 44 (остаток 1)
    // 6.  44/2 = 22 (остаток 0)
    // 5.  22/2 = 11 (остаток 0)
    // 4.  11/2 = 5  (остаток 1)
    // 3.  5/2  = 2  (остаток 1)
    // 2.  2/2  = 1  (остаток 0)
    // 1.  0/2  = 0  (остаток 1)
    // B3 = 10110011
}
